import kkkk
import pytest

#def test_translit_accuracy():
    #translit(sentence, max_length = 1024)

def test_check_length_too_long():
	txt = '''
		Бунёдгузори адабиёти форсу тоҷик Абӯабдуллоҳ Рӯдакӣ соли 858 дар деҳаи Панҷрӯд аз тавобеъи Самарқанд (бинобар ин дар баъзе сарчашмаҳо Рӯдакии Самарқандӣ низ меноманд), 
		ки акнун рустое аз ноҳияи Панҷакент дар вилояти Суғд аст, ба дунё омадааст. 
		Таърихи ҳазору сад солаи адабиёти тоҷик бо номи бунёдгузори он устод Рӯдакӣ сахт вобаста аст. 
		Рӯдакиро муосиронаш ва суханварони баъдина бо унвонҳои ифтихорӣ: 
		Одамушуаро форсӣ: آدم الشعرا‎ Қофиласорои назми форсӣ, Соҳибқирони шоирон, Султони шоирон, Мақаддумушуаро ва ҳамсони инҳо ёд мекунанд. 
		Асосгузор ва сардафтари адабиёт аслан маънои онро надорад ки пеш аз дигарон асар эҷод карда бошад.
		'''
	assert kkkk.check_length(txt) == False
	
def test_check_length_blank():
	txt = ''
	assert kkkk.check_length(txt) == False

def test_check_length_ok():
	txt = '''
		Бунёдгузори адабиёти форсу тоҷик Абӯабдуллоҳ Рӯдакӣ соли 858 дар деҳаи Панҷрӯд аз тавобеъи Самарқанд (бинобар ин дар баъзе сарчашмаҳо Рӯдакии Самарқандӣ низ меноманд), 
		ки акнун рустое аз ноҳияи Панҷакент дар вилояти Суғд аст, ба дунё омадааст. 
		'''
	assert kkkk.check_length(txt) == True
		
def test_split_n_translit_dots_only():
	txt = '......'
	assert kkkk.split_n_translit(txt) == False

def test_split_n_translit_ok():
	txt = '''
		Таърихи ҳазору сад солаи адабиёти тоҷик бо номи бунёдгузори он устод Рӯдакӣ сахт вобаста аст. 
		Рӯдакиро муосиронаш ва суханварони баъдина бо унвонҳои ифтихорӣ: 
		Одамушуаро форсӣ: آدم الشعرا‎ Қофиласорои назми форсӣ, Соҳибқирони шоирон, Султони шоирон, Мақаддумушуаро ва ҳамсони инҳо ёд мекунанд. 
		Асосгузор ва сардафтари адабиёт аслан маънои онро надорад ки пеш аз дигарон асар эҷод карда бошад.
		'''
	assert kkkk.split_n_translit(txt) == True
